# StructuralCodeName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..StructuralCodeName Property
Family Class See Also
---
The family's structural code name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string StructuralCodeName { get; set; }
```

Visual Basic
---
```text
Public Property StructuralCodeName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ StructuralCodeName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Family Class
Autodesk.Revit.DB Namespace